#### Terraform Plan 📋
```
data.aws_ami.amazon_linux: Reading...
aws_security_group.msp_sg: Refreshing state... [id=sg-00b6db98edc2a7dac]
data.aws_ami.amazon_linux: Read complete after 0s [id=ami-0fc6cf99992956a4a]
aws_instance.msp_03: Refreshing state... [id=i-00cc255d34e031d95]
aws_instance.msp_05: Refreshing state... [id=i-0aef408f2b1c56608]
aws_instance.msp_02: Refreshing state... [id=i-02e920f45ee733696]
aws_instance.msp_04: Refreshing state... [id=i-09a1e62f679aa8d0d]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.msp_02 has been deleted
  - resource "aws_instance" "msp_02" {
      - id                                   = "i-02e920f45ee733696" -> null
      - public_ip                            = "3.238.185.231" -> null
        tags                                 = {
            "Name" = "msp-02"
        }
        # (32 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.msp_03 has been deleted
  - resource "aws_instance" "msp_03" {
      - id                                   = "i-00cc255d34e031d95" -> null
      - public_ip                            = "98.84.47.49" -> null
        tags                                 = {
            "Name" = "msp-03"
        }
        # (32 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.msp_04 has been deleted
  - resource "aws_instance" "msp_04" {
      - id                                   = "i-09a1e62f679aa8d0d" -> null
      - public_ip                            = "54.237.164.10" -> null
        tags                                 = {
            "Name" = "msp-04"
        }
        # (32 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.msp_05 has been deleted
  - resource "aws_instance" "msp_05" {
      - id                                   = "i-0aef408f2b1c56608" -> null
      - public_ip                            = "44.192.113.143" -> null
        tags                                 = {
            "Name" = "msp-05"
        }
        # (32 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.msp_02 will be created
  + resource "aws_instance" "msp_02" {
      + ami                                  = "ami-0fc6cf99992956a4a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "whh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"      = "msp-02"
          + "Recreated" = "true"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "msp-02"
          + "Project"     = "msp-infrastructure"
          + "Recreated"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "96adf618926f7f6023a627679ea74941cbfd9e20"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-00b6db98edc2a7dac",
        ]

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # aws_instance.msp_03 will be created
  + resource "aws_instance" "msp_03" {
      + ami                                  = "ami-0fc6cf99992956a4a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "whh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "msp-03"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "msp-03"
          + "Project"     = "msp-infrastructure"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "96adf618926f7f6023a627679ea74941cbfd9e20"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-00b6db98edc2a7dac",
        ]

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # aws_instance.msp_04 will be created
  + resource "aws_instance" "msp_04" {
      + ami                                  = "ami-0fc6cf99992956a4a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "whh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "msp-04"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "msp-04"
          + "Project"     = "msp-infrastructure"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "96adf618926f7f6023a627679ea74941cbfd9e20"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-00b6db98edc2a7dac",
        ]

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # aws_instance.msp_05 will be created
  + resource "aws_instance" "msp_05" {
      + ami                                  = "ami-0fc6cf99992956a4a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "whh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "msp-05"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "msp-05"
          + "Project"     = "msp-infrastructure"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "96adf618926f7f6023a627679ea74941cbfd9e20"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-00b6db98edc2a7dac",
        ]

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ msp_02_instance_id = "i-02e920f45ee733696" -> (known after apply)
  ~ msp_02_public_ip   = "3.238.185.231" -> (known after apply)
  ~ msp_03_instance_id = "i-00cc255d34e031d95" -> (known after apply)
  ~ msp_03_public_ip   = "98.84.47.49" -> (known after apply)
  ~ msp_04_instance_id = "i-09a1e62f679aa8d0d" -> (known after apply)
  ~ msp_04_public_ip   = "54.237.164.10" -> (known after apply)
  ~ msp_05_instance_id = "i-0aef408f2b1c56608" -> (known after apply)
  ~ msp_05_public_ip   = "44.192.113.143" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Triggered by @imzouwei-lang*